{
  "Id": {
    "Firstname": "Arian",
    "Lastname": "Bod",
    "Nickname": "",
    "Title": "Front End Developer | Project Manager | Entrepreneur",
    "Summary": "As a seasoned Front End Developer with experience from 2014 to 2023, I possess a deep understanding of developing scalable and user-friendly web applications. Throughout the years, I have honed my technical skills in JavaScript, React, HTML5, CSS3, and other front-end technologies. While working as a PMO Project Manager, I successfully developed and managed various projects, enhanced operational methods, and monitored performance.\n\nAs the Idea Owner and CEO of a startup with over 100 employees, I led my team to create a widely-used application that provided a viable alternative to traditional school education during the COVID-19 pandemic. This venture allowed me to combine my front-end development expertise and entrepreneurial spirit to produce something meaningful and impactful.\n\nIn my recent work, I have continued to expand my skillset by working on front-end projects and developing smart contracts on the Ethereum blockchain. With my diverse background, I excel at collaborating with cross-functional teams, managing projects, and delivering high-quality results."
  },
  "ContactInformation": {
    "Phone": "",
    "Email": "arianbod@outlook.com",
    "SocialMedia": {
      "LinkedIn": "https://linkedin.com/arianbod",
      "Telegram": "https://t.me/arianbod",
      "GitHub": "https://github.com/arianbod",
      "Twitter": "",
      "Instagram": ""
    }
  },
  "Languages": [
    {
      "Language": "English",
      "Level": "Fluent",
      "Certificate": "TOEFL",
      "score": "95",
      "reading": "",
      "writing": "",
      "speaking": "",
      "listening": ""
    },
    {
      "Language": "Persian",
      "Level": "Native",
      "score": "",
      "reading": "",
      "writing": "",
      "speaking": "",
      "listening": ""
    },
    {
      "Language": "Arabic",
      "Level": "Beginner",
      "Certificate": "",
      "score": "",
      "reading": "",
      "writing": "",
      "speaking": "",
      "listening": ""
    },
    {
      "Language": "Turkish",
      "Level": "Intermediate",
      "Certificate": "",
      "score": "",
      "reading": "",
      "writing": "",
      "speaking": "",
      "listening": ""
    }
  ],
  "WorkHistory": {
    "CEO": [
      {
        "Title": "CEO",
        "Employer": "Shad (The Student Education Network)",
        "StartDate": "2019-11",
        "EndDate": "2021-11",
        "Description": "In 2020-2021, our application became the most widely used tool in the country, serving as the primary means for students to continue their learning journey from home.\nImplemented aggressive new market strategies that resulted in a revenue increase of 200% above expectations.\nMentored senior managers to enhance employee job satisfaction and performance, leading to improved business outcomes.\nPioneered innovative promotional tactics that expanded customer base, increased market share, and fostered greater engagement and growth.\nSuccessfully negotiated business acquisitions to expand company operations and establish a stronger market presence.\nEffectively managed key partnerships and strategic business relationships, skillfully navigating conflict and negotiating favorable contract terms.",
        "Technologies": ""
      }
    ],
    "Project Manager": [],
    "Others": [
      {
        "Title": "Project Manager, PMO",
        "Employer": "Mobile Telecommunication Company of Iran",
        "StartDate": "2018-11",
        "EndDate": "2019-06",
        "Description": "Creating tailored user manuals for specific system configurations that catered to individual employee skill profiles.\nEnhancing operational methods and streamlining accounting procedures for improved efficiency.\nDeveloping and leading projects, ensuring efficient cost management and monitoring performance.\nEstablishing and nurturing relationships with material vendors, resulting in cost savings and expanded capabilities.",
        "Technologies": ""
      },

      {
        "Title": "Cryptocurrency Trader",
        "Employer": "Private Customers",
        "StartDate": "2021-08",
        "EndDate": "2023-02",
        "Description": "Compiled and analyzed data to determine approaches to improve performance.\nEducated and worked with clients on ROI terms to find accurate solutions.\nGenerated 250% in revenue by analyzing individual stock, coins and current market conditions in two years.\nPrepared contracts and related documentation according to strict standards.\nComputed total holdings, dividends or commissions to allocate appropriate payments to customers.\nStick Hardly on Risk Management with fewest possible drawdown",
        "Technologies": ""
      }
    ],
    "Freelance": [
      {
        "Title": "Smart Contract developer",
        "Employer": "Smart Contract developer",
        "StartDate": "2022-11",
        "EndDate": "2023-03",
        "Description": "Implemented Smart Contracts on ethereum, Binance Chain and Layer 2 Blockchains\nCollaborated with Marketing team to review application requirements, plan implementation details and estimate delivery timelines.\nWrote technical documentation to communicate key points to stakeholders.\nBuilt stable and secure systems to translate dense technical topics to stakeholders less versed with blockchain applications.\nImplemented, tested and audited open-source software to interact with on-chain smart contracts.\nLed projects and analyzed data to identify opportunities for improvement.",
        "Technologies": ""
      },
      {
        "Title": "SPA and Mobile Application for an Ethereum-Based Token",
        "Employer": "SPA and Mobile Application",
        "StartDate": "2023-01",
        "EndDate": "2023-03",
        "Description": "Utilized ReactJS for building the frontend user interface, providing a seamless and interactive experience on both web and mobile platforms.\nConfigured and deployed the application on an Ubuntu server, ensuring optimal performance and reliability.\nImplemented Nginx as a web server to handle incoming requests and serve the SPA website, while ensuring proper routing for the mobile application.\nSecured the website and mobile application with Certbot, enabling HTTPS encryption and safeguarding user data privacy.\nIntegrated Web3.js library to establish a connection with the Ethereum blockchain network.\nEnabled users to connect their wallets, such as MetaMask, to seamlessly interact with the token functionalities.\nImplemented features for buying, selling, staking, and unstaking the token through connected wallets.\nDesigned the user interface with CSS3 and Material UI, delivering a modern and visually appealing experience on both web and mobile platforms.",
        "Technologies": ""
      }
    ],
    "Trading": [],
    "FrontEnd": [
      {
        "Title": "Front End Developer",
        "Employer": "Rubika LLC",
        "StartDate": "2017-12",
        "EndDate": "2018-07",
        "Description": "Built a single-page application with multiple views using route services to enhance user experience, utilizing ReactJS and JavaScript (ES6)\nDeveloped front-end user interface components and integrated them with server-side logic using Node.js and Express\nDesigned REST API endpoints for client-side communication using ReactJS, Redux, and RESTful APIs\nUsed Bootstrap and Material UI frameworks for building responsive websites for different devices\nWrote unit tests for each new feature using the Jasmine testing framework\nWorked in a Scrum environment as part of an engineering team, collaborating with other developers and stakeholders to design and implement features\nExperienced in HTML5, CSS3, LESS, and JSON for building and styling web applications\nFamiliarity with GIT and JIRA for source control and tracking purposes\nProficient in Node.js, MongoDB, ReactJS, Redux, Express, and Webpack for building full-stack web applications.",
        "Technologies": ""
      },
      {
        "Title": "Front-End Developer",
        "Employer": "Pardis Hooshmand Aseman LLC",
        "StartDate": "2016-10",
        "EndDate": "2017-12",
        "Description": "Designed and developed the React-Redux framework to create scalable applications using component-based architecture\nCreated a search form with various parameters and combinations for data retrieval, utilizing React and RESTful APIs\nWrote, refactored, and tested dozens of new components with a focus on best practices for styling in a large codebase\nDeveloped a rule editor React component for creating and populating rules from API's with conditional statements\nCreated a React-Redux framework to generate dynamic forms, panels, and pages from user configuration files\nExperienced with HTML5, LESS, React, Webpack, NPM, and Yarn for building and styling web applications\nProficient in GIT, JEST, and ESLint for source control, testing, and code quality purposes\nExperienced in Visual Studio Code and IntelliJ for development and debugging purposes."
      },
      {
        "Title": "Front-End Developer",
        "Employer": "Shegeftangizan LLC",
        "StartDate": "2014-03",
        "EndDate": "2016-01",
        "Description": "Developed, enhanced, and fixed UI bugs using JavaScript, jQuery, React.js, HTML5, and CSS3.\nDesigned and developed RESTful APIs to consume in UI.\nIntegrated user-facing elements with server-side logic using Node.js and Express.\nEnvironment: React.js, Node.js, Express, HTML5, CSS3, JSON, Bootstrap.\nCreated front-end user interface using React.js, HTML5, and LESS to interact with microservices.\nResponsible for styling, look, and feel of the web page with LESS that extends CSS with dynamic behaviors such as variables, mixins, operations, and functions.\nEnvironment: React.js, HTML5, LESS, and MongoDB.",
        "Technologies": ""
      }
    ]
  },
  "Education": [
    {
      "Degree": "MSc",
      "FieldOfStudy": "Management Information Systems",
      "School": "Khaje Nasir Tousi University",
      "StartDate": "2019",
      "EndDate": "2022",
      "Description": "Ranked within the top 5 universities in Iran according to the CWUR"
    },

    {
      "Degree": "B.Sc",
      "FieldOfStudy": "Information Technology",
      "School": "University of Ghiaseddin Jamshid Kashani",
      "StartDate": "2012-09",
      "EndDate": "2018-04",
      "Description": "Ghiaseddin Jamshid Kashani University - Iran, Qazvin, Abyek"
    }
  ],

  "Skills": {
    "seasonedSkills": [
      {
        "Skill": "JavaScript",
        "Level": "Advanced",
        "Details": "In-depth knowledge of JavaScript programming language, including ES6+ features and modern JavaScript frameworks."
      },
      {
        "Skill": "ReactJS",
        "Level": "Advanced",
        "Details": "Proficient in developing web applications using ReactJS, a popular JavaScript library for building user interfaces."
      },
      {
        "Skill": "Bash Script",
        "Level": "Intermediate",
        "Details": "Ability to write and execute Bash scripts to automate tasks and improve productivity in Unix/Linux environments."
      },
      {
        "Skill": "Attention to Detail",
        "Level": "Advanced",
        "Details": "Meticulous in work, pays close attention to accuracy and completeness in all tasks and deliverables."
      },
      {
        "Skill": "Problem-Solving",
        "Level": "Advanced",
        "Details": "Analyzes complex problems, identifies root causes, and develops innovative and practical solutions."
      }
    ],
    "SoftSkills": [
      {
        "Skill": "Communication",
        "Level": "Advanced",
        "Details": "Effective verbal and written communication skills, adept at conveying complex ideas to diverse audiences."
      },
      {
        "Skill": "Team Building",
        "Level": "Advanced",
        "Details": "Proven ability to foster collaboration, motivate team members, and build cohesive and high-performing teams."
      },
      {
        "Skill": "Adaptability",
        "Level": "Advanced",
        "Details": "Quickly adapts to new environments and challenges, demonstrates flexibility in changing circumstances."
      },
      {
        "Skill": "Strategic Thinking",
        "Level": "Advanced",
        "Details": "Develops and executes strategic plans, identifies opportunities, and makes informed decisions."
      },
      {
        "Skill": "Emotional Intelligence",
        "Level": "Advanced",
        "Details": "Recognizes and manages emotions in self and others, builds positive relationships, and demonstrates empathy."
      },
      {
        "Skill": "Time Management",
        "Level": "Advanced",
        "Details": "Efficiently prioritizes tasks, meets deadlines, and utilizes time effectively to maximize productivity."
      },
      {
        "Skill": "Attention to Detail",
        "Level": "Advanced",
        "Details": "Meticulous in work, pays close attention to accuracy and completeness in all tasks and deliverables."
      },
      {
        "Skill": "Problem-Solving",
        "Level": "Advanced",
        "Details": "Analyzes complex problems, identifies root causes, and develops innovative and practical solutions."
      },
      {
        "Skill": "Training and Development",
        "Level": "Advanced",
        "Details": "Designs and delivers effective training programs, facilitates learning, and supports professional growth."
      },
      {
        "Skill": "Critical Thinking",
        "Level": "Advanced",
        "Details": "Applies logical and analytical thinking to evaluate situations, generate insights, and make sound decisions."
      },
      {
        "Skill": "Teamwork and Collaboration",
        "Level": "Advanced",
        "Details": "Collaborates effectively with team members, values diverse perspectives, and achieves common goals."
      },
      {
        "Skill": "Creativity",
        "Level": "Advanced",
        "Details": "Demonstrates innovative thinking, generates unique ideas, and finds creative solutions to challenges."
      }
    ],
    "Development": [
      {
        "Skill": "ReactJS",
        "Level": "Advanced",
        "Details": "Proficient in developing web applications using ReactJS, a popular JavaScript library for building user interfaces."
      },
      {
        "Skill": "Next.js",
        "Level": "Intermediate",
        "Details": "Familiar with Next.js, a framework for building server-side rendered and statically generated React applications."
      },
      {
        "Skill": "Redux",
        "Level": "Advanced",
        "Details": "Extensive experience in managing application state using Redux, a predictable state container for JavaScript apps."
      },
      {
        "Skill": "JavaScript",
        "Level": "Advanced",
        "Details": "In-depth knowledge of JavaScript programming language, including ES6+ features and modern JavaScript frameworks."
      },
      {
        "Skill": "JQuery",
        "Level": "Intermediate",
        "Details": "Proficient in using JQuery library to simplify HTML document traversing, event handling, and Ajax interactions."
      },
      {
        "Skill": "React Native",
        "Level": "Intermediate",
        "Details": "Experience in developing cross-platform mobile applications using React Native framework."
      },
      {
        "Skill": "Version control",
        "Level": "Advanced",
        "Details": "Proficient in using Git version control system for collaborative development and source code management."
      },
      {
        "Skill": "HTML5",
        "Level": "Advanced",
        "Details": "Strong knowledge of HTML5 markup language and its latest features for creating structured web content."
      },
      {
        "Skill": "UX",
        "Level": "Intermediate",
        "Details": "Understanding of UX design principles and ability to create intuitive and user-friendly interfaces."
      },
      {
        "Skill": "CSS3",
        "Level": "Advanced",
        "Details": "Expertise in Cascading Style Sheets (CSS3) for styling and layout of web pages with modern design techniques."
      },
      {
        "Skill": "Less",
        "Level": "Intermediate",
        "Details": "Proficient in using Less, a CSS preprocessor, to create more maintainable and modular stylesheets."
      },
      {
        "Skill": "Material UI",
        "Level": "Intermediate",
        "Details": "Familiarity with Material-UI library, a popular React component library implementing Material Design."
      },
      {
        "Skill": "NoSQL",
        "Level": "Intermediate",
        "Details": "Experience in working with MongoDB, a NoSQL database, for storing and retrieving data in scalable applications."
      },
      {
        "Skill": "SQL",
        "Level": "Intermediate",
        "Details": "Proficient in SQL (Structured Query Language) for managing relational databases and writing efficient queries."
      },
      {
        "Skill": "Bash Script",
        "Level": "Intermediate",
        "Details": "Ability to write and execute Bash scripts to automate tasks and improve productivity in Unix/Linux environments."
      },
      {
        "Skill": "Webpack",
        "Level": "Intermediate",
        "Details": "Familiar with Webpack, a popular module bundler, for optimizing and bundling JavaScript and CSS assets."
      },
      {
        "Skill": "API testing tools",
        "Level": "Intermediate",
        "Details": "Experience in using API testing tools like Postman or Insomnia to test and document RESTful APIs."
      },
      {
        "Skill": "Authentication",
        "Level": "Intermediate",
        "Details": "Knowledge of common authentication and authorization methods used in web applications."
      },
      {
        "Skill": "RESTful APIs",
        "Level": "Intermediate",
        "Details": "Proficient in designing and developing RESTful APIs using frameworks like Express (Node.js) or Flask (Python)."
      }
    ],
    "Market Technical Analysis": [
      {
        "Skill": "TradingView",
        "Level": "Advanced",
        "Details": "Proficient in using TradingView platform for charting, technical analysis, and market research."
      },
      {
        "Skill": "Risk Management",
        "Level": "Advanced",
        "Details": "Deep understanding of risk management techniques and strategies in financial markets."
      },
      {
        "Skill": "Advanced Elliott Wave",
        "Level": "Intermediate",
        "Details": "Familiarity with Advanced Elliott Wave theory and its application in market analysis."
      },
      {
        "Skill": "Understanding Order Blocks",
        "Level": "Intermediate",
        "Details": "Ability to identify and analyze order blocks in price charts for making trading decisions."
      },
      {
        "Skill": "Fibonacci Retracement and Extensions",
        "Level": "Intermediate",
        "Details": "Knowledge of Fibonacci retracement and extension levels for determining potential support and resistance areas."
      },
      {
        "Skill": "Candlestick Patterns",
        "Level": "Intermediate",
        "Details": "Proficient in recognizing and interpreting common candlestick patterns for predicting price movements."
      },
      {
        "Skill": "Trend Analysis",
        "Level": "Intermediate",
        "Details": "Skillful in identifying and analyzing market trends to make informed trading decisions."
      },
      {
        "Skill": "Support and Resistance Analysis",
        "Level": "Intermediate",
        "Details": "Ability to identify key support and resistance levels in price charts for determining entry and exit points."
      },
      {
        "Skill": "Risk-Reward Ratio Analysis",
        "Level": "Intermediate",
        "Details": "Understanding of risk-reward ratio and its application in evaluating potential trade opportunities."
      },
      {
        "Skill": "Technical Indicators",
        "Level": "Intermediate",
        "Details": "Proficient in using a variety of technical indicators (e.g., MACD, RSI, Moving Averages) for market analysis."
      },
      {
        "Skill": "Pattern Recognition",
        "Level": "Intermediate",
        "Details": "Ability to identify and interpret chart patterns (e.g., triangles, head and shoulders) for making trading decisions."
      },
      {
        "Skill": "Risk Assessment",
        "Level": "Intermediate",
        "Details": "Skillful in assessing and managing risks associated with different trading strategies."
      }
    ]
  },
  "Unused": {
    "Degree": "Iranian Master Entrance Exam",
    "FieldOfStudy": "Information Technology",
    "School": "Top 1% of Iranian Master's Entrance Exam",
    "StartDate": "2018",
    "EndDate": "",
    "Description": "Ranked 519 out of over 614000 participants"
  }
}
