{
  "Id": {
    "firstname": "آریان",
    "lastname": "آریان بود",
    "nickname": ""
  },
  "ContactInformation": {
    "Phone": "",
    "Email": ""
  },
  "Experiences": [
    {
      "Title": "توسعه دهنده فرانت اند",
      "Company": "پروژه مدیریت",
      "Description": "به عنوان یک توسعه دهنده فرانت اند با سابقه کار از سال ۲۰۱۴ تا ۲۰۲۳، توانایی توسعه برنامه های وب قابل مقیاس و کاربر پسند را دارا هستم. در طول سالها، مهارت های فنی خود را در JavaScript، React، HTML5، CSS3 و سایر فناوری های فرانت اند بهبود بخشیده ام. در حین کار به عنوان مدیر پروژه PMO، موفق شدم در مدیریت و توسعه پروژه های مختلف، بهبود روش های عملیاتی و نظارت بر عملکرد پیشرفت کنم."
    },
    {
      "Title": "توسعه دهنده قراردادهای هوشمند",
      "Company": "پروژه مدیریت",
      "Description": "پیاده سازی قراردادهای هوشمند در Ethereum، Binance Chain و Layer 2 Blockchains. همکاری با تیم بازاریابی برای بررسی نیازمندی های برنامه، برنامه ریزی جزئیات اجرا و برآورد زمانبندی تحویل. نگارش مستندات فنی برای انتقال نکات کلیدی به سایر صاحبان سهم. ساختن سیستم های پایدار و امن برای ترجمه موضوعات فنی پیچیده به صاحبان سهم کمتر آشنا با برنامه های بلاکچین. پیاده سازی، تست و حسابرسی نرم افزار متن باز برای ارتباط با قراردادهای هوشمند."
    },
    {
      "Title": "معامله گر ارزهای رمزی",
      "Company": "مشتریان خصوصی",
      "Description": "تجزیه و تحلیل داده ها برای تعیین رویکردهای بهبود عملکرد. آموزش و همکاری با مشتریان در مورد شرایط بازگشت سرمایه برای یافتن راه حل های دقیق. تولید 250٪ درآمد با تجزیه و تحلیل سهام فردی، سکه ها و شرایط بازار فعلی در دو سال. آماده سازی قراردادها و مستندات مربوطه وفقاً با استانداردهای دقیق. محاسبه مجموع دارایی ها، سود سهام یا کمیسیون ها برای تخصیص پرداخت های مناسب به مشتریان. مدیریت ریسک با حداقل کشیدن کمترین امکان"
    },
    {
      "Title": "مدیر عامل",
      "Company": "شاد (شبکه آموزش دانش آموز)",
      "Description": "در سال ۲۰۲۰-۲۰۲۱، برنامه ما به عنوان محبوب ترین ابزار کشور به عنوان راه اصلی برای دانش آموزان برای ادامه مسیر یادگیری خود از خانه شناخته شد. پیاده سازی استراتژی های جدید و سودآوری که منجر به افزایش درآمد ۲۰۰٪ بیشتر از انتظارات شد. راهنمایی مدیران برتر برای بهبود رضایت شغلی و عملکرد کارمندان، منجر به بهبود نتایج کسب و کار شد. تاکتیک های تبلیغاتی نوآورانه راهبردی راه اندازی که پایه مشتریان را گسترش داده، سهم بازار را افزایش داده و رشد و توسعه بیشتری ایجاد کرده است. با موفقیت مذاکراتی را برای توسعه فعالیت های شرکت و ایجاد حضور بازاری قوی تر به انجام رسانده است. مدیریت موثر شراکت های استراتژیک و روابط تجاری با نهادهای دیگر. ارتقای استانداردهای عملیاتی و کیفیت خدمات برای بهبود تجربه مشتریان."
    }
  ],
  "Skills": [
    {
      "name": "JavaScript",
      "level": "حرفه‌ای"
    },
    {
      "name": "React",
      "level": "حرفه‌ای"
    },
    {
      "name": "HTML5",
      "level": "حرفه‌ای"
    },
    {
      "name": "CSS3",
      "level": "حرفه‌ای"
    },
    {
      "name": "قراردادهای هوشمند",
      "level": "متوسط"
    },
    {
      "name": "تجزیه و تحلیل داده",
      "level": "متوسط"
    },
    {
      "name": "مدیریت پروژه",
      "level": "متوسط"
    },
    {
      "name": "مذاکره",
      "level": "متوسط"
    },
    {
      "name": "مدیریت ریسک",
      "level": "متوسط"
    }
  ]
}
